/* eslint-disable no-console */
console.log(`%cArt Quiz`, 'font-weight: bold; font-size: 18px');
console.log(
  `https://github.com/rolling-scopes-school/tasks/blob/master/tasks/art-quiz/art-quiz.md\n\n`,
);
console.log(`%cСамооценка:`, 'font-weight: bold;');
console.log(`
Выполнены все пункты задания.
✔️ Стартовая страница и навигация +20
Пояснения:
=> иконка "<" в хедере возвращает на предыдущую страницу;
=> лого в хедере всегда возвращает на стартовую страницу;
=> на карточке сыгранной категории ссылка на результаты раунда появляется по клику (появляется ховер с вариантами "играть еще" и "статистика"). Также на результаты ведет клик по цифре количества ответов (справа от названия категории).
✔️ Настройки +40
Пояснения:
=> Настройки сохраняются автоматически при изменении.
✔️ Страница категорий +30
✔️ Страница с вопросами +50
✔️ Страница с результатами +50
Пояснения:
=> Результат повторного прохождения раунда фиксируется после прохождения раунда (категории). До его завершения - продолжает отображаться предыдущий сохраненный результат.
✔️ Одновременная загрузка и плавная смена изображений +10
✔️ Анимация +20
Примеры анимации:
=> Плавные переходы между состяниями приложения (смена контента)
=> Анимация появления модального окна
=> Анимация лоадера загрузки контента (можно явно увидеть в квизе по картинам)
=> Анимация появления блока настроек
=> Анимация таймера
=> Анимация иконки настроек
✔️ Дополнительный функционал на выбор +14
=> фоновая музыка и отдельный пункт в настройках (вкл/выкл и громкость) для неё [+2]
=> разные уведомления по окончанию раунда в зависимости от результата [+2]
=> перевод приложения на два языка [+5]
=> возможность скачать картину на компьютер (ссылка на скачивание отображается в модальном окне с подробной информацией о картине) [+5]
=> возможность выполнить сброс данных и начать прохождение раундов заново (кнопка в настройках) [+?]
`);
console.log(`%cИтого: 234/220 => 220`, 'font-weight: bold');
